In [1]:
import pyodbc
import numpy as np
import pandas as pd

In [2]:
path=pyodbc.connect('Driver={SQL Server};''Server=DESKTOP-79QHG70\SQLEXPRESS;''Database=shalini;''Trusted_Connection=yes')
cursor=path.cursor()

In [4]:
cursor.execute('select * from dbo.employees')
for i in cursor:
    print(i)

(63679, 'SANDRINE', 'CLERK', 69062, '1990-12-18', Decimal('900.00'), None, 2001)
(64989, 'ADELYN', 'SALESMAN', 66928, '1991-02-20', Decimal('1700.00'), Decimal('400.00'), 3001)
(65271, 'WADE', 'SALESMAN', 66928, '1991-02-22', Decimal('1350.00'), Decimal('600.00'), 3001)
(65646, 'JONAS', 'MANAGER', 68319, '1991-04-02', Decimal('2957.00'), None, 2001)
(66564, 'MADDEN', 'SALESMAN', 66928, '1991-09-28', Decimal('1350.00'), Decimal('1500.00'), 3001)
(66928, 'BLAZE', 'MANAGER', 68319, '1991-05-01', Decimal('2750.00'), None, 3001)
(67832, 'CLARE ', 'MANAGER', 68319, '1991-06-09', Decimal('2550.00'), None, 1001)
(67858, 'SCARLET', 'ANALYST', 65646, '1997-04-19', Decimal('3100.00'), None, 2001)
(68319, 'KAYLING', 'PRESIDENT', None, '1991-11-18', Decimal('6000.00'), None, 1001)
(68454, 'TUCKER', 'SALESMAN', 66928, '1991-09-08', Decimal('600.00'), Decimal('0.00'), 3001)
(68736, 'ADNRES', 'CLERK', 67858, '1997-05-23', Decimal('1200.00'), None, 2001)
(69000, 'JULIUS', 'CLERK', 66928, '1991-12-03', Decimal('1050.00'), None, 3001)
(69062, 'FRANK ', 'ANALYST', 65646, '1991-12-03', Decimal('3100.00'), None, 2001)
(69324, 'MARKER', 'CLERK', 67832, '1992-01-23', Decimal('1400.00'), None, 1001)

In [5]:
cursor.execute('select * from sys.tables')
for i in cursor:
    print(i)

('department', 885578193, None, 1, 0, 'U ', 'USER_TABLE', datetime.datetime(2022, 9, 23, 11, 2, 18, 540000), datetime.datetime(2022, 9, 23, 11, 2, 36, 950000), False, False, False, 0, None, 3, False, True, False, False, False, False, False, 0, False, False, 0, 'TABLE', False, False, 0, 'SCHEMA_AND_DATA', 0, 'NON_TEMPORAL_TABLE', None, False, False, None, None, None, False, False)
('salary_grade', 917578307, None, 1, 0, 'U ', 'USER_TABLE', datetime.datetime(2022, 9, 23, 11, 2, 23, 20000), datetime.datetime(2022, 9, 23, 11, 2, 23, 20000), False, False, False, 0, None, 3, False, True, False, False, False, False, False, 0, False, False, 0, 'TABLE', False, False, 0, 'SCHEMA_AND_DATA', 0, 'NON_TEMPORAL_TABLE', None, False, False, None, None, None, False, False)
('employees', 949578421, None, 1, 0, 'U ', 'USER_TABLE', datetime.datetime(2022, 9, 23, 11, 2, 36, 943000), datetime.datetime(2022, 9, 23, 11, 2, 36, 943000), False, False, False, 0, None, 8, False, True, False, False, False, False, False, 0, False, False, 0, 'TABLE', False, False, 0, 'SCHEMA_AND_DATA', 0, 'NON_TEMPORAL_TABLE', None, False, False, None, None, None, False, False)

In [6]:
cursor.execute('select * from sys.databases')
for i in cursor:
    print(i)

('master', 1, None, b'\x01', datetime.datetime(2003, 4, 8, 9, 13, 36, 390000), 150, 'SQL_Latin1_General_CP1_CI_AS', 0, 'MULTI_USER', False, False, False, 0, 'ONLINE', False, False, False, 1, 'ON', False, 3, 'SIMPLE', 2, 'CHECKSUM', True, False, True, False, False, False, False, False, False, False, False, False, False, False, False, False, False, True, False, False, False, False, False, False, False, False, '00000000-0000-0000-0000-000000000000', False, 0, 'NOTHING', False, False, False, False, None, None, None, None, None, None, None, None, None, None, 0, 'NONE', 0, 0, 'DISABLED', False, False, False, True, True, 0, 'DATABASE_DEFAULT', 'master', False, False, False, False, True)
('tempdb', 2, None, b'\x01', datetime.datetime(2022, 9, 22, 4, 1, 49, 317000), 150, 'SQL_Latin1_General_CP1_CI_AS', 0, 'MULTI_USER', False, False, False, 0, 'ONLINE', False, False, False, 0, 'OFF', False, 3, 'SIMPLE', 2, 'CHECKSUM', True, False, True, False, False, False, False, False, False, False, False, False, False, False, False, False, False, True, False, False, False, False, False, False, False, False, '9DB165FD-F559-441C-8D5B-75C0B8BB522B', True, 0, 'NOTHING', False, False, False, False, None, None, None, None, None, None, None, None, None, None, 0, 'NONE', 60, 0, 'DISABLED', False, False, False, False, True, 0, 'DATABASE_DEFAULT', 'tempdb', False, False, False, False, True)
('model', 3, None, b'\x01', datetime.datetime(2003, 4, 8, 9, 13, 36, 390000), 150, 'SQL_Latin1_General_CP1_CI_AS', 0, 'MULTI_USER', False, False, False, 0, 'ONLINE', False, False, False, 0, 'OFF', False, 3, 'SIMPLE', 2, 'CHECKSUM', True, False, True, False, False, False, False, False, False, False, False, False, False, False, False, False, False, False, False, False, False, False, False, False, False, False, '00000000-0000-0000-0000-000000000000', False, 0, 'NOTHING', False, False, False, False, None, None, None, None, None, None, None, None, None, None, 0, 'NONE', 60, 0, 'DISABLED', False, False, False, True, True, 0, 'DATABASE_DEFAULT', 'model', False, False, False, False, True)
('msdb', 4, None, b'\x01', datetime.datetime(2019, 9, 24, 14, 21, 42, 270000), 150, 'SQL_Latin1_General_CP1_CI_AS', 0, 'MULTI_USER', False, False, False, 0, 'ONLINE', False, False, False, 1, 'ON', False, 3, 'SIMPLE', 2, 'CHECKSUM', True, False, True, False, False, False, False, False, False, False, False, False, False, False, False, True, True, True, False, False, False, False, False, False, False, False, 'B04C1D53-8D6A-4B39-B9B6-F52471E6FA28', True, 0, 'NOTHING', False, False, False, False, None, None, None, None, None, None, None, None, None, None, 0, 'NONE', 60, 0, 'DISABLED', False, False, False, True, True, 0, 'DATABASE_DEFAULT', 'msdb', False, False, False, False, True)
('shalini', 5, None, b"\x01\x05\x00\x00\x00\x00\x00\x05\x15\x00\x00\x00\x18\xed\x0e'I\xb0\t\xfdb\xa4\xc1\x05\xe9\x03\x00\x00", datetime.datetime(2022, 9, 23, 11, 2, 3, 730000), 150, 'SQL_Latin1_General_CP1_CI_AS', 0, 'MULTI_USER', False, True, False, 0, 'ONLINE', False, False, False, 0, 'OFF', False, 3, 'SIMPLE', 2, 'CHECKSUM', True, False, True, False, False, False, False, False, False, False, False, False, False, False, False, True, False, False, False, False, False, False, False, False, False, False, '22C45244-7CA0-4E34-9E03-997486F0F370', True, 0, 'NOTHING', False, False, False, False, None, None, None, None, None, None, None, None, None, None, 0, 'NONE', 60, 0, 'DISABLED', False, False, False, False, True, 0, 'DATABASE_DEFAULT', 'shalini', False, False, False, False, True)

In [9]:
cursor.execute('select * from employees')
a=cursor.fetchone()
a

(63679, 'SANDRINE', 'CLERK', 69062, '1990-12-18', Decimal('900.00'), None, 2001)

In [10]:
cursor.execute('select * from employees')
b=cursor.fetchall()
b

[(63679, 'SANDRINE', 'CLERK', 69062, '1990-12-18', Decimal('900.00'), None, 2001),
 (64989, 'ADELYN', 'SALESMAN', 66928, '1991-02-20', Decimal('1700.00'), Decimal('400.00'), 3001),
 (65271, 'WADE', 'SALESMAN', 66928, '1991-02-22', Decimal('1350.00'), Decimal('600.00'), 3001),
 (65646, 'JONAS', 'MANAGER', 68319, '1991-04-02', Decimal('2957.00'), None, 2001),
 (66564, 'MADDEN', 'SALESMAN', 66928, '1991-09-28', Decimal('1350.00'), Decimal('1500.00'), 3001),
 (66928, 'BLAZE', 'MANAGER', 68319, '1991-05-01', Decimal('2750.00'), None, 3001),
 (67832, 'CLARE ', 'MANAGER', 68319, '1991-06-09', Decimal('2550.00'), None, 1001),
 (67858, 'SCARLET', 'ANALYST', 65646, '1997-04-19', Decimal('3100.00'), None, 2001),
 (68319, 'KAYLING', 'PRESIDENT', None, '1991-11-18', Decimal('6000.00'), None, 1001),
 (68454, 'TUCKER', 'SALESMAN', 66928, '1991-09-08', Decimal('600.00'), Decimal('0.00'), 3001),
 (68736, 'ADNRES', 'CLERK', 67858, '1997-05-23', Decimal('1200.00'), None, 2001),
 (69000, 'JULIUS', 'CLERK', 66928, '1991-12-03', Decimal('1050.00'), None, 3001),
 (69062, 'FRANK ', 'ANALYST', 65646, '1991-12-03', Decimal('3100.00'), None, 2001),
 (69324, 'MARKER', 'CLERK', 67832, '1992-01-23', Decimal('1400.00'), None, 1001)]

In [12]:
cursor.execute("select * from employees where emp_name like 'a%'")
c=cursor.fetchall()
c

[(64989, 'ADELYN', 'SALESMAN', 66928, '1991-02-20', Decimal('1700.00'), Decimal('400.00'), 3001),
 (68736, 'ADNRES', 'CLERK', 67858, '1997-05-23', Decimal('1200.00'), None, 2001)]

In [14]:
cursor.execute("select sum(salary),job_name from employees group by job_name")
d=cursor.fetchall()
d

[(Decimal('6200.00'), 'ANALYST'),
 (Decimal('4550.00'), 'CLERK'),
 (Decimal('8257.00'), 'MANAGER'),
 (Decimal('6000.00'), 'PRESIDENT'),
 (Decimal('5000.00'), 'SALESMAN')]

In [16]:
cursor.execute('create table xyz(id int, name char(30),place char(30))')

In [17]:
cursor.execute('select * from sys.tables')
e=cursor.fetchall()
e

[('department', 885578193, None, 1, 0, 'U ', 'USER_TABLE', datetime.datetime(2022, 9, 23, 11, 2, 18, 540000), datetime.datetime(2022, 9, 23, 11, 2, 36, 950000), False, False, False, 0, None, 3, False, True, False, False, False, False, False, 0, False, False, 0, 'TABLE', False, False, 0, 'SCHEMA_AND_DATA', 0, 'NON_TEMPORAL_TABLE', None, False, False, None, None, None, False, False),
 ('salary_grade', 917578307, None, 1, 0, 'U ', 'USER_TABLE', datetime.datetime(2022, 9, 23, 11, 2, 23, 20000), datetime.datetime(2022, 9, 23, 11, 2, 23, 20000), False, False, False, 0, None, 3, False, True, False, False, False, False, False, 0, False, False, 0, 'TABLE', False, False, 0, 'SCHEMA_AND_DATA', 0, 'NON_TEMPORAL_TABLE', None, False, False, None, None, None, False, False),
 ('employees', 949578421, None, 1, 0, 'U ', 'USER_TABLE', datetime.datetime(2022, 9, 23, 11, 2, 36, 943000), datetime.datetime(2022, 9, 23, 11, 2, 36, 943000), False, False, False, 0, None, 8, False, True, False, False, False, False, False, 0, False, False, 0, 'TABLE', False, False, 0, 'SCHEMA_AND_DATA', 0, 'NON_TEMPORAL_TABLE', None, False, False, None, None, None, False, False),
 ('xyz', 997578592, None, 1, 0, 'U ', 'USER_TABLE', datetime.datetime(2022, 9, 23, 12, 13, 58, 453000), datetime.datetime(2022, 9, 23, 12, 13, 58, 453000), False, False, False, 0, None, 3, False, True, False, False, False, False, False, 0, False, False, 0, 'TABLE', False, False, 0, 'SCHEMA_AND_DATA', 0, 'NON_TEMPORAL_TABLE', None, False, False, None, None, None, False, False)]

In [18]:
cursor.execute("insert into xyz values(1,'priya','delhi')")

In [19]:
cursor.execute("select * from xyz")
f=cursor.fetchall()

In [20]:
f

[(1, 'priya                         ', 'delhi                         ')]

In [87]:
class test():
    def select(self,a):
        cursor.execute('select * from '+a)
        print(cursor.fetchall())
    def insert(self,b,c):
        cursor.execute('insert into '+b+" values("+c+")")
        print(cursor.fetchall())

In [88]:
x=test()

In [89]:
x.select('xyz')

[(1, 'priya                         ', 'delhi                         '), (110, 'Rahul                         ', 'new                           '), (110, 'Rahul                         ', 'new                           ')]

In [91]:
x.insert('xyz',"2,'riya','jodhpur'")

ProgrammingError: No results.  Previous SQL was not a query.

In [113]:
class DML:
    def select(self,a,b):
        cursor.execute("select "+b+ " from " + a)
        print(cursor.fetchall())
    def insert(self,a,b):
        cursor.execute(("insert into "+a+" values("+b+")"))
        cursor.execute("select * from "+a)
        print(cursor.fetchall())
    def update(self,a,b,c,d):
        cursor.execute(("update "+a+" set "+b+" where "+c+" ="+d))
        cursor.execute("select * from "+a)
        print(cursor.fetchall())
    def delete(self,a,b,c):
        cursor.execute(("delete from "+a+" where "+b+"="+c))
        cursor.execute("select * from "+a)
        print(cursor.fetchall())

In [114]:
z=DML()

In [115]:
z.select("employees","*")

[(63679, 'SANDRINE', 'CLERK', 69062, '1990-12-18', Decimal('900.00'), None, 2001), (64989, 'ADELYN', 'SALESMAN', 66928, '1991-02-20', Decimal('1700.00'), Decimal('400.00'), 3001), (65271, 'WADE', 'SALESMAN', 66928, '1991-02-22', Decimal('1350.00'), Decimal('600.00'), 3001), (65646, 'JONAS', 'MANAGER', 68319, '1991-04-02', Decimal('2957.00'), None, 2001), (66564, 'MADDEN', 'SALESMAN', 66928, '1991-09-28', Decimal('1350.00'), Decimal('1500.00'), 3001), (66928, 'BLAZE', 'MANAGER', 68319, '1991-05-01', Decimal('2750.00'), None, 3001), (67832, 'CLARE ', 'MANAGER', 68319, '1991-06-09', Decimal('2550.00'), None, 1001), (67858, 'SCARLET', 'ANALYST', 65646, '1997-04-19', Decimal('3100.00'), None, 2001), (68319, 'KAYLING', 'PRESIDENT', None, '1991-11-18', Decimal('6000.00'), None, 1001), (68454, 'TUCKER', 'SALESMAN', 66928, '1991-09-08', Decimal('600.00'), Decimal('0.00'), 3001), (68736, 'ADNRES', 'CLERK', 67858, '1997-05-23', Decimal('1200.00'), None, 2001), (69000, 'JULIUS', 'CLERK', 66928, '1991-12-03', Decimal('1050.00'), None, 3001), (69062, 'FRANK ', 'ANALYST', 65646, '1991-12-03', Decimal('3100.00'), None, 2001), (69324, 'MARKER', 'CLERK', 67832, '1992-01-23', Decimal('1400.00'), None, 1001)]

In [116]:
z.insert('xyz',"110,'Rahul','new'")

[(1, 'priya                         ', 'okay                          '), (110, 'Rahul                         ', 'new                           '), (110, 'Rahul                         ', 'new                           '), (2, 'riya                          ', 'jodhpur                       '), (2, 'riya                          ', 'jodhpur                       '), (110, 'Rahul                         ', 'new                           '), (110, 'Rahul                         ', 'new                           '), (110, 'Rahul                         ', 'new                           ')]

In [117]:
z.update('xyz',"place='okay'",'id','1')

[(1, 'priya                         ', 'okay                          '), (110, 'Rahul                         ', 'new                           '), (110, 'Rahul                         ', 'new                           '), (2, 'riya                          ', 'jodhpur                       '), (2, 'riya                          ', 'jodhpur                       '), (110, 'Rahul                         ', 'new                           '), (110, 'Rahul                         ', 'new                           '), (110, 'Rahul                         ', 'new                           ')]

In [118]:
z.delete('xyz','id','110')

[(1, 'priya                         ', 'okay                          '), (2, 'riya                          ', 'jodhpur                       '), (2, 'riya                          ', 'jodhpur                       ')]